Documents/Бюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Бюджет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БюджетРасходы</xr:Item>
				<xr:Item>InformationRegister.СтруктураБюджетаРасходы</xr:Item>
				<xr:Item>AccumulationRegister.БюджетДоходы</xr:Item>
				<xr:Item>InformationRegister.СтруктураБюджетаДоходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Детализация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Утвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокНаНачало</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПланирования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоГруппа</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПланирования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасхода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоГруппа</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасходыПоНаправлениямДеятельности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПланирования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтруктураДоходов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоГруппа</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтруктураРасходов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасхода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоГруппа</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Бюджет/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс

// Функция возвращает время документа по умолчанию.
// Требуется если пользователь используется опцию:
// "Время документов устанавливать автоматически".
//
// Возвращаемое значение:
//    Структура - Структура с ключами "Часы" и "Минуты".
//
Функция ВремяДокументаПоУмолчанию() Экспорт
	
	Возврат Новый Структура("Часы, Минуты", 8, 0);
	
КонецФункции

// Функция возвращает последний бюджет по организации
//
// Параметры:
//    Организация - Справочник.Организации - Организация, по которой был сформирован бюджет
// Возвращаемое значение:
//    ДокументСсылка.Бюджет - Ссылка на Документ "Бюджет"
//
Функция ПоследнийБюджет(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Бюджет.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Бюджет КАК Бюджет
	|ГДЕ
	|	Бюджет.Организация = &Организация
	|	И Бюджет.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Бюджет.Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Документы.Бюджет.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Функция возвращает бюджет по организации и периоду
//
// Параметры:
//    Организация - Справочник.Организации - Организация, по которой был сформирован бюджет
//    Период - Дата - Период, на который составляется бюджет (год)
// Возвращаемое значение:
//    ДокументСсылка.Бюджет - Ссылка на Документ "Бюджет"
//
Функция БюджетНаПериод(Организация, Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период",      Период);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Бюджет.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Бюджет КАК Бюджет
	|ГДЕ
	|	Бюджет.Организация = &Организация
	|	И Бюджет.Проведен
	|	И Бюджет.Период = &Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Бюджет.Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Документы.Бюджет.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Функция возвращает признак есть ли бюджет по организации в этом периоде
//
// Параметры:
//    Организация - Справочник.Организации - Организация, по которой запрашивается бюджет
//    Период - Дата - Дата, на которую запрашивается бюджет
// Возвращаемое значение:
//    Булево - Истина, в случае если бюджет на указанный период есть
//
Функция ЕстьБюджетНаПериод(Организация, Период) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ВестиУчетБюджета") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период",      НачалоГода(Период));
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Бюджет.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Бюджет КАК Бюджет
	|ГДЕ
	|	Бюджет.Организация = &Организация
	|	И Бюджет.Проведен
	|	И Бюджет.Период = &Период";
	РезультатЗапроса = Запрос.Выполнить();
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

// Функция возвращает данные бюджета
//
// Параметры:
//    Ссылка - Документ.Бюджет - Ссылка на документ, которых хранит данные бюджета.
// Возвращаемое значение:
//    Структура - Структура с данными документа
//
Функция ДанныеБюджета(Ссылка) Экспорт
	
	ДанныеБюджета = БюджетДоходовРасходов.НовыйДанныеБюджета();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Бюджет.Организация КАК Организация,
	|	Бюджет.Детализация КАК Детализация,
	|	Бюджет.Период КАК Период,
	|	Бюджет.Утвержден КАК Утвержден,
	|	Бюджет.ОстатокНаНачало КАК ОстатокНаНачало,
	|	Бюджет.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.Бюджет КАК Бюджет
	|ГДЕ
	|	Бюджет.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ДанныеБюджета.Реквизиты.Добавить(), Выборка);
	
	Реквизиты = ДанныеБюджета.Реквизиты[0];
	
	Запрос.УстановитьПараметр("ПоМесяцам", Реквизиты.Детализация = Перечисления.Периодичность.Месяц);
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(Реквизиты.Период));
	Запрос.УстановитьПараметр("КонецГода", КонецГода(Реквизиты.Период));
	Запрос.УстановитьПараметр("Организация", Реквизиты.Организация);
	
	Запрос.УстановитьПараметр("КорректировкиБюджета", Документы.КорректировкаБюджета.ВсеКорректировки(Ссылка));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БюджетДоходы.ДатаПланирования КАК ДатаПланирования,
	|	БюджетДоходы.СтатьяДохода КАК СтатьяДохода,
	|	БюджетДоходы.ЭтоГруппа КАК ЭтоГруппа,
	|	СУММА(БюджетДоходы.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_БюджетДоходы
	|ИЗ
	|	Документ.Бюджет.Доходы КАК БюджетДоходы
	|ГДЕ
	|	БюджетДоходы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	БюджетДоходы.ДатаПланирования,
	|	БюджетДоходы.СтатьяДохода,
	|	БюджетДоходы.ЭтоГруппа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаДоходы.ДатаПланирования,
	|	КорректировкаДоходы.СтатьяДохода,
	|	КорректировкаДоходы.ЭтоГруппа,
	|	СУММА(КорректировкаДоходы.СуммаКорректировки)
	|ИЗ
	|	Документ.КорректировкаБюджета.Доходы КАК КорректировкаДоходы
	|ГДЕ
	|	КорректировкаДоходы.Ссылка В(&КорректировкиБюджета)
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаДоходы.ДатаПланирования,
	|	КорректировкаДоходы.СтатьяДохода,
	|	КорректировкаДоходы.ЭтоГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_БюджетДоходы.ДатаПланирования КАК ДатаПланирования,
	|	ВТ_БюджетДоходы.СтатьяДохода КАК СтатьяДохода,
	|	ВТ_БюджетДоходы.ЭтоГруппа КАК ЭтоГруппа,
	|	СУММА(ВТ_БюджетДоходы.Сумма) КАК Сумма
	|ИЗ
	|	ВТ_БюджетДоходы КАК ВТ_БюджетДоходы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_БюджетДоходы.ДатаПланирования,
	|	ВТ_БюджетДоходы.СтатьяДохода,
	|	ВТ_БюджетДоходы.ЭтоГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БюджетРасходы.ДатаПланирования КАК ДатаПланирования,
	|	БюджетРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	БюджетРасходы.СтатьяРасхода КАК СтатьяРасхода,
	|	БюджетРасходы.ЭтоГруппа КАК ЭтоГруппа,
	|	СУММА(БюджетРасходы.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_БюджетРасходы
	|ИЗ
	|	Документ.Бюджет.Расходы КАК БюджетРасходы
	|ГДЕ
	|	БюджетРасходы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	БюджетРасходы.ДатаПланирования,
	|	БюджетРасходы.НаправлениеДеятельности,
	|	БюджетРасходы.СтатьяРасхода,
	|	БюджетРасходы.ЭтоГруппа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРасходы.ДатаПланирования,
	|	КорректировкаРасходы.НаправлениеДеятельности,
	|	КорректировкаРасходы.СтатьяРасхода,
	|	КорректировкаРасходы.ЭтоГруппа,
	|	СУММА(КорректировкаРасходы.СуммаКорректировки)
	|ИЗ
	|	Документ.КорректировкаБюджета.Расходы КАК КорректировкаРасходы
	|ГДЕ
	|	КорректировкаРасходы.Ссылка В(&КорректировкиБюджета)
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаРасходы.ДатаПланирования,
	|	КорректировкаРасходы.НаправлениеДеятельности,
	|	КорректировкаРасходы.СтатьяРасхода,
	|	КорректировкаРасходы.ЭтоГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_БюджетРасходы.ДатаПланирования КАК ДатаПланирования,
	|	ВТ_БюджетРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВТ_БюджетРасходы.СтатьяРасхода КАК СтатьяРасхода,
	|	ВТ_БюджетРасходы.ЭтоГруппа КАК ЭтоГруппа,
	|	СУММА(ВТ_БюджетРасходы.Сумма) КАК Сумма
	|ИЗ
	|	ВТ_БюджетРасходы КАК ВТ_БюджетРасходы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_БюджетРасходы.ДатаПланирования,
	|	ВТ_БюджетРасходы.НаправлениеДеятельности,
	|	ВТ_БюджетРасходы.СтатьяРасхода,
	|	ВТ_БюджетРасходы.ЭтоГруппа";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДоходы = РезультатыЗапроса[1].Выбрать();
	Пока ВыборкаДоходы.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеБюджета.Доходы.Добавить(), ВыборкаДоходы);
	КонецЦикла;
	
	ВыборкаРасходы = РезультатыЗапроса[3].Выбрать();
	Пока ВыборкаРасходы.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеБюджета.Расходы.Добавить(), ВыборкаРасходы);
	КонецЦикла;
	
	// Будет модифицирован схемой
	ТекстЗапросаСтруктураБюджета = 
	"ВЫБРАТЬ
	|	БюджетРасходыПоНаправлениямДеятельности.ДатаПланирования КАК ДатаПланирования,
	|	БюджетРасходыПоНаправлениямДеятельности.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	БюджетРасходыПоНаправлениямДеятельности.Сумма КАК Сумма
	|ИЗ
	|	Документ.Бюджет.РасходыПоНаправлениямДеятельности КАК БюджетРасходыПоНаправлениямДеятельности
	|ГДЕ
	|	БюджетРасходыПоНаправлениямДеятельности.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПланирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БюджетСтруктураДоходов.СтатьяДохода КАК СтатьяДохода,
	|	БюджетСтруктураДоходов.Родитель КАК Родитель,
	|	БюджетСтруктураДоходов.ЭтоГруппа КАК ЭтоГруппа
	|ИЗ
	|	Документ.Бюджет.СтруктураДоходов КАК БюджетСтруктураДоходов
	|ГДЕ
	|	БюджетСтруктураДоходов.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	БюджетСтруктураДоходов.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БюджетСтруктураРасходов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	БюджетСтруктураРасходов.СтатьяРасхода КАК СтатьяРасхода,
	|	БюджетСтруктураРасходов.Родитель КАК Родитель,
	|	БюджетСтруктураРасходов.ЭтоГруппа КАК ЭтоГруппа
	|ИЗ
	|	Документ.Бюджет.СтруктураРасходов КАК БюджетСтруктураРасходов
	|ГДЕ
	|	БюджетСтруктураРасходов.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	БюджетСтруктураРасходов.НомерСтроки";
	
	// Актуальная структура бюджета хранится всегда в последней корректировке,
	// либо в самом бюджете, если корректировки не вводились.
	ПоследняяКорректировка = Документы.КорректировкаБюджета.ПоследняяКорректировка(Ссылка);
	ИмяДокумента = ПоследняяКорректировка.Метаданные().Имя;
	
	СхемаЗапросаСтруктураБюджета = Новый СхемаЗапроса;
	СхемаЗапросаСтруктураБюджета.УстановитьТекстЗапроса(ТекстЗапросаСтруктураБюджета);
	
	Для Каждого ЗапросПакета Из СхемаЗапросаСтруктураБюджета.ПакетЗапросов Цикл
		ПолноеИмяТаблицыДокумента = ЗапросПакета.Операторы[0].Источники[0].Источник.ИмяТаблицы;
		ЧастиИмениТаблицыДокумента = СтрРазделить(ПолноеИмяТаблицыДокумента, ".");
		ИмяТабличнойЧасти = ЧастиИмениТаблицыДокумента[ЧастиИмениТаблицыДокумента.ВГраница()];
		ТаблицаСхемы = ЗапросПакета.ДоступныеТаблицы.Найти(СтрШаблон("Документ.%1.%2", ИмяДокумента, ИмяТабличнойЧасти));
		ЗапросПакета.Операторы[0].Источники.Заменить(0, ТаблицаСхемы);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Ссылка", ПоследняяКорректировка);
	Запрос.Текст = СхемаЗапросаСтруктураБюджета.ПолучитьТекстЗапроса();
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаПоНаправлениямДеятельности = РезультатыЗапроса[0].Выбрать();
	Пока ВыборкаПоНаправлениямДеятельности.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеБюджета.РасходыПоНаправлениямДеятельности.Добавить(), ВыборкаПоНаправлениямДеятельности);
	КонецЦикла;
	
	ВыборкаСтруктураДоходов = РезультатыЗапроса[1].Выбрать();
	Пока ВыборкаСтруктураДоходов.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеБюджета.СтруктураДоходов.Добавить(), ВыборкаСтруктураДоходов);
	КонецЦикла;
	
	ВыборкаСтруктураРасходов = РезультатыЗапроса[2].Выбрать();
	Пока ВыборкаСтруктураРасходов.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеБюджета.СтруктураРасходов.Добавить(), ВыборкаСтруктураРасходов);
	КонецЦикла;
	
	Возврат ДанныеБюджета;
	
КонецФункции

// Функция возвращает табличный документ с бюджетом доходов и расходов
//
// Параметры:
//    Параметры - Структура - Структура с обязательным параметром Ссылка на документ "Бюджет"
// Возвращаемое значение:
//    ТабличныйДокумент - Печатная форма бюджета доходов и расходов
//
Функция СформироватьПечатнуюФорму(Параметры) Экспорт
	
	ДанныеБюджета      = ДанныеБюджета(Параметры.Ссылка);
	РеквизитыДокумента = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ДанныеБюджета.Реквизиты[0]);
	КолонкиДетализации = БюджетДоходовРасходов.НовыйКолонкиДетализации();
	БюджетДоходовРасходов.ЗаполнитьКолонкиДетализации(КолонкиДетализации, РеквизитыДокумента);
	
	ДополнитьБюджетОстатками(ДанныеБюджета, РеквизитыДокумента);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("БюджетДоходовРасходов");
	
	ВывестиШапку(РеквизитыДокумента, КолонкиДетализации, ТабличныйДокумент, Макет);
	
	ВывестиОстаткиНаНачало(ДанныеБюджета.ОстаткиНачало, ТабличныйДокумент, Макет);
	
	ВывестиДоходы(ДанныеБюджета, КолонкиДетализации, ТабличныйДокумент, Макет);
	
	ВывестиРасходы(ДанныеБюджета, КолонкиДетализации, ТабличныйДокумент, Макет);
	
	ВывестиОстаткиНаКонец(ДанныеБюджета.ОстаткиКонец, ТабличныйДокумент, Макет);
	
	ВывестиПодвал(РеквизитыДокумента, ТабличныйДокумент, Макет);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Получает описание предопределенных наборов свойств.
//
// Параметры:
//  Наборы - ДеревоЗначений - с колонками:
//     * Имя           - Строка - Имя набора свойств. Формируется из полного имени объекта
//                       метаданных заменой символа "." на "_".
//                       Например, "Документ_ЗаказПокупателя".
//     * Идентификатор - УникальныйИдентификатор - Идентификатор ссылки предопределенного элемента.
//     * Используется  - Неопределено, Булево - Признак того, что набор свойств используется.
//                       Например, можно использовать для скрытия набора по функциональным опциям.
//                       Значение по умолчанию - Неопределено, соответствует значению Истина.
//     * ЭтоГруппа     - Булево - Истина, если набор свойств является группой.
//
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_Бюджет";
	Набор.ЭтоГруппа = Истина;
	Набор.Идентификатор = Новый УникальныйИдентификатор("bc9f1ac7-943d-41b7-b3f3-15e54e453373");
	Набор.Используется  = ПолучитьФункциональнуюОпцию("ВестиУчетБюджета");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		// Бюджет редактируется через форму специальной обработки "Бюджет"
		Если Параметры.Свойство("Ключ") Тогда
			Параметры.Вставить("ДокументСсылка", Параметры.Ключ);
		КонецЕсли;
		ВыбраннаяФорма = "Обработка.Бюджет.Форма";
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПодготовкаПараметровПроведения

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	НомераТаблиц = Новый Структура;
	
	Запрос.Текст = ТекстЗапросаРеквизитыДокумента(НомераТаблиц);
	Результат    = Запрос.ВыполнитьПакет();
	ТаблицаРеквизиты = Результат[НомераТаблиц["Реквизиты"]].Выгрузить();
	ПараметрыПроведения.Вставить("Реквизиты", ТаблицаРеквизиты);
	
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаРеквизиты[0]);
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаРасходы(НомераТаблиц) +
		ТекстЗапросаДоходы(НомераТаблиц) +
		ТекстЗапросаСтруктураДоходов(НомераТаблиц) +
		ТекстЗапросаСтруктураРасходов(НомераТаблиц);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Если НЕ ПустаяСтрока(Запрос.Текст) Тогда
		Для Каждого НомерТаблицы Из НомераТаблиц Цикл
			ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
		КонецЦикла;
	КонецЕсли;
	
	Возврат ПараметрыПроведения;
	
КонецФункции 

Функция ТекстЗапросаРеквизитыДокумента(НомераТаблиц)
	
	НомераТаблиц.Вставить("ВременнаяТаблицаРеквизиты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Реквизиты", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Бюджет.Ссылка КАК Регистратор,
	|	Бюджет.Дата КАК Период,
	|	Бюджет.Организация КАК Организация,
	|	Бюджет.Детализация КАК Детализация
	|ПОМЕСТИТЬ Реквизиты
	|ИЗ
	|	Документ.Бюджет КАК Бюджет
	|ГДЕ
	|	Бюджет.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Регистратор КАК Регистратор,
	|	Реквизиты.Период КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.Детализация КАК Детализация
	|ИЗ
	|	Реквизиты КАК Реквизиты";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаРасходы(НомераТаблиц)
	
	НомераТаблиц.Вставить("Расходы", НомераТаблиц.Количество());
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	БюджетРасходы.ДатаПланирования КАК Период,
	|	БюджетРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	БюджетРасходы.СтатьяРасхода КАК СтатьяРасхода,
	|	БюджетРасходы.Сумма КАК Сумма
	|ИЗ
	|	Документ.Бюджет.Расходы КАК БюджетРасходы
	|ГДЕ
	|	БюджетРасходы.Ссылка = &Ссылка
	|	И БюджетРасходы.ДатаПланирования <> ДАТАВРЕМЯ(1, 1, 1)
	|	И НЕ БюджетРасходы.ЭтоГруппа";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
КонецФункции

Функция ТекстЗапросаДоходы(НомераТаблиц)
	
	НомераТаблиц.Вставить("Доходы", НомераТаблиц.Количество());
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	БюджетДоходы.ДатаПланирования КАК Период,
	|	БюджетДоходы.СтатьяДохода КАК СтатьяДохода,
	|	БюджетДоходы.ЭтоГруппа КАК ЭтоГруппа,
	|	БюджетДоходы.Сумма КАК Сумма
	|ИЗ
	|	Документ.Бюджет.Доходы КАК БюджетДоходы
	|ГДЕ
	|	БюджетДоходы.Ссылка = &Ссылка
	|	И БюджетДоходы.ДатаПланирования <> ДАТАВРЕМЯ(1, 1, 1)
	|	И НЕ БюджетДоходы.ЭтоГруппа";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаСтруктураДоходов(НомераТаблиц)

	НомераТаблиц.Вставить("СтруктураДоходов", НомераТаблиц.Количество());
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	БюджетСтруктураДоходов.СтатьяДохода КАК СтатьяДохода,
	|	БюджетСтруктураДоходов.Родитель КАК Родитель,
	|	БюджетСтруктураДоходов.ЭтоГруппа КАК ЭтоГруппа
	|ИЗ
	|	Документ.Бюджет.СтруктураДоходов КАК БюджетСтруктураДоходов
	|ГДЕ
	|	БюджетСтруктураДоходов.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаСтруктураРасходов(НомераТаблиц)

	НомераТаблиц.Вставить("СтруктураРасходов", НомераТаблиц.Количество());
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	БюджетСтруктураРасходов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	БюджетСтруктураРасходов.СтатьяРасхода КАК СтатьяРасхода,
	|	БюджетСтруктураРасходов.Родитель КАК Родитель,
	|	БюджетСтруктураРасходов.ЭтоГруппа КАК ЭтоГруппа
	|ИЗ
	|	Документ.Бюджет.СтруктураРасходов КАК БюджетСтруктураРасходов
	|ГДЕ
	|	БюджетСтруктураРасходов.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом


// СтандартныеПодсистемы.УправлениеПечатью

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеПечатью


// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#КонецОбласти

#Область ТабличныйДокумент

Процедура ДополнитьБюджетОстатками(ДанныеБюджета, Реквизиты)

	// Суммы
	ТаблицаДоходов = ДанныеБюджета.Доходы.Скопировать(Новый Структура("ЭтоГруппа", Ложь));
	ТаблицаДоходов.Свернуть("ДатаПланирования", "Сумма");
	ТаблицаРасходов = ДанныеБюджета.РасходыПоНаправлениямДеятельности.Скопировать();
	ТаблицаРасходов.Свернуть("ДатаПланирования", "Сумма");
	
	ТаблицаОстатков = ТаблицаДоходов.Скопировать();
	Для Каждого Строка Из ТаблицаРасходов Цикл
		НоваяСтрока = ТаблицаОстатков.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, , "Сумма");
		НоваяСтрока.Сумма = -Строка.Сумма;
	КонецЦикла;
	ТаблицаОстатков.Свернуть("ДатаПланирования", "Сумма");
	ТаблицаОстатков.Сортировать("ДатаПланирования Возр");
	
	ТаблицаОстатковНачало = ТаблицаОстатков.СкопироватьКолонки();
	ТаблицаОстатковКонец = ТаблицаОстатков.СкопироватьКолонки();
	
	НакопленныйОстаток = Реквизиты.ОстатокНаНачало;
	
	Для Каждого Строка Из ТаблицаОстатков Цикл
		Если Не ЗначениеЗаполнено(Строка.ДатаПланирования) Тогда
			СтрокаНачало = ТаблицаОстатковНачало.Добавить();
			СтрокаНачало.Сумма = Реквизиты.ОстатокНаНачало;
			СтрокаКонец = ТаблицаОстатковКонец.Добавить();
			СтрокаКонец.Сумма = Реквизиты.ОстатокНаНачало + Строка.Сумма;
		Иначе
			СтрокаНачало = ТаблицаОстатковНачало.Добавить();
			СтрокаНачало.ДатаПланирования = Строка.ДатаПланирования;
			СтрокаНачало.Сумма = НакопленныйОстаток;
			
			СтрокаКонец = ТаблицаОстатковКонец.Добавить();
			СтрокаКонец.ДатаПланирования = Строка.ДатаПланирования;
			НакопленныйОстаток = НакопленныйОстаток + Строка.Сумма;
			СтрокаКонец.Сумма = НакопленныйОстаток;
		КонецЕсли;
	КонецЦикла;
	
	ДанныеБюджета.Вставить("ОстаткиНачало", ТаблицаОстатковНачало);
	ДанныеБюджета.Вставить("ОстаткиКонец",  ТаблицаОстатковКонец);
	
КонецПроцедуры

Процедура ВывестиШапку(РеквизитыДокумента, КолонкиДетализации, ТабличныйДокумент, Макет)
	
	// Шапка
	РеквизитыДокумента.Вставить("ПериодПредставление", Формат(РеквизитыДокумента.Период, "ДФ='yyyy ""г.""'"));
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Заполнить(РеквизитыДокумента);
	ТабличныйДокумент.Вывести(Шапка);
	
	// Шапка таблицы
	ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы|ОсновнаяЧасть");
	ТабличныйДокумент.Вывести(ШапкаТаблицы);
	ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы|Итого");
	ТабличныйДокумент.Присоединить(ШапкаТаблицы);
	
	СтруктураПараметров = Новый Структура;
	Если РеквизитыДокумента.Детализация = Перечисления.Периодичность.Квартал Тогда
		НадписьДетализация = НСтр("ru='кварталам'");
	Иначе
		НадписьДетализация = НСтр("ru='месяцам'");
	КонецЕсли;
	СтруктураПараметров.Вставить("НадписьДетализация", НадписьДетализация);
	
	НомерЯчейкиНачало = ТабличныйДокумент.ШиринаТаблицы;
	Для Каждого Колонка Из КолонкиДетализации Цикл
		СтруктураПараметров.Вставить("ДетализацияПериода", Колонка.Заголовок);
		ШапкаТаблицаПериод = Макет.ПолучитьОбласть("ШапкаТаблицы|Детализация");
		ШапкаТаблицаПериод.Параметры.Заполнить(СтруктураПараметров);
		ТабличныйДокумент.Присоединить(ШапкаТаблицаПериод);
	КонецЦикла;
	НомерЯчейкиКонец = ТабличныйДокумент.ШиринаТаблицы;
	НомерСтроки = ТабличныйДокумент.ВысотаТаблицы - 1; // Объединяем только верхнюю строку, где написано "В том числе по"
	ТабличныйДокумент.Область(НомерСтроки, НомерЯчейкиНачало, НомерСтроки, НомерЯчейкиКонец).Объединить();
	
КонецПроцедуры

Процедура ВывестиДоходы(ДанныеБюджета, КолонкиДетализации, ТабличныйДокумент, Макет)
	
	Если Не ЗначениеЗаполнено(ДанныеБюджета.Доходы) Тогда
		Возврат;
	КонецЕсли;
	
	// Раздел "Доходы"
	Раздел = НСтр("ru='Финансирование'");
	ВывестиРаздел(Раздел, КолонкиДетализации, ТабличныйДокумент, Макет);
	
	// Строки таблицы
	СтруктураПоиска = Новый Структура("Родитель", Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка());
	ТаблицаСтруктурыДоходов = ДанныеБюджета.СтруктураДоходов.Скопировать(СтруктураПоиска);
	ВывестиДоходыСИерархией(ТаблицаСтруктурыДоходов, "", ДанныеБюджета, КолонкиДетализации, ТабличныйДокумент, Макет, 0);
	
	// Итоги по разделу
	ОбластьИтогоПоРазделу = Макет.ПолучитьОбласть("ИтогоПоРазделу|ОсновнаяЧасть");
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НадписьИтогоПоРазделу", НСтр("ru='Итого финансирования:'"));
	ОбластьИтогоПоРазделу.Параметры.Заполнить(СтруктураПараметров);
	ТабличныйДокумент.Вывести(ОбластьИтогоПоРазделу);
	
	ТаблицаДоходов = ДанныеБюджета.Доходы.Скопировать();
	ТаблицаДоходов.Свернуть("ДатаПланирования", "Сумма");
	ВывестиСуммы(ТаблицаДоходов, "ИтогоПоРазделу", Макет, ТабличныйДокумент);
	
КонецПроцедуры

Процедура ВывестиДоходыСИерархией(ТаблицаСтруктураДоходов, НомерПоПорядку, ДанныеБюджета, КолонкиДетализации, ТабличныйДокумент, Макет, Уровень)
	
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаДохода|ОсновнаяЧасть");
	НовыйНомерПоПорядку = 1;
	
	Для Каждого СтрокаДоходы Из ТаблицаСтруктураДоходов Цикл
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("НомерСтроки",  СтрШаблон("%1%2", НомерПоПорядку, НовыйНомерПоПорядку));
		СтруктураПараметров.Вставить("СтатьяДохода", СтрокаДоходы.СтатьяДохода);
		ОбластьСтрока.Параметры.Заполнить(СтруктураПараметров);
		ОбластьСтрока.Области.СтатьяДохода.Отступ = Уровень * 2;
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		
		ТаблицаДоходовПоСтатье = ДанныеБюджета.Доходы.Скопировать(Новый Структура("СтатьяДохода", СтрокаДоходы.СтатьяДохода));
		ВывестиСуммы(ТаблицаДоходовПоСтатье, "СтрокаДохода", Макет, ТабличныйДокумент);
		
		Если СтрокаДоходы.ЭтоГруппа Тогда
			НомерПоПорядкуДляСледующейГруппы = СтрШаблон("%1%2.", НомерПоПорядку, НовыйНомерПоПорядку);
			НоваяТаблицаСтруктурыДоходов = ДанныеБюджета.СтруктураДоходов.Скопировать(
				Новый Структура("Родитель", СтрокаДоходы.СтатьяДохода));
			НовыйУровень = Уровень + 1;
			ВывестиДоходыСИерархией(
				НоваяТаблицаСтруктурыДоходов,
				НомерПоПорядкуДляСледующейГруппы,
				ДанныеБюджета,
				КолонкиДетализации,
				ТабличныйДокумент,
				Макет,
				НовыйУровень);
		КонецЕсли;
		НовыйНомерПоПорядку = НовыйНомерПоПорядку + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиРаздел(ИмяРаздела, КолонкиДетализации, ТабличныйДокумент, Макет)

	Раздел = Макет.ПолучитьОбласть("Раздел|ОсновнаяЧасть");
	Раздел.Параметры.Заполнить(Новый Структура("Раздел", ИмяРаздела));
	ТабличныйДокумент.Вывести(Раздел);
	РазделИтого = Макет.ПолучитьОбласть("Раздел|Итого");
	ТабличныйДокумент.Присоединить(РазделИтого);
	
	НомерЯчейкиНачало = РазделИтого.ШиринаТаблицы + Раздел.ШиринаТаблицы + 1;
	Счетчик = 1;
	Пока Счетчик < КолонкиДетализации.Количество() Цикл
		РазделПериод = Макет.ПолучитьОбласть("Раздел|Детализация");
		ТабличныйДокумент.Присоединить(РазделПериод);
		Счетчик = Счетчик + 1;
	КонецЦикла;
	НомерЯчейкиКонец = ТабличныйДокумент.ШиринаТаблицы;
	НомерСтроки = ТабличныйДокумент.ВысотаТаблицы;
	ОбластьОбъединения = ТабличныйДокумент.Область(НомерСтроки, НомерЯчейкиНачало, НомерСтроки, НомерЯчейкиКонец);
	ОбластьОбъединения.Объединить();
	ОбластьОбъединения.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	
КонецПроцедуры

Процедура ВывестиОстаткиНаНачало(Остатки, ТабличныйДокумент, Макет)
	
	// Остатки
	ОбластьИтогоПоРазделу = Макет.ПолучитьОбласть("ИтогоПоРазделу|ОсновнаяЧасть");
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НадписьИтогоПоРазделу", НСтр("ru='Остаток на начало:'"));
	ОбластьИтогоПоРазделу.Параметры.Заполнить(СтруктураПараметров);
	ТабличныйДокумент.Вывести(ОбластьИтогоПоРазделу);
	
	// Суммы
	ВывестиСуммы(Остатки, "ИтогоПоРазделу", Макет, ТабличныйДокумент);
	
КонецПроцедуры

Процедура ВывестиОстаткиНаКонец(Остатки, ТабличныйДокумент, Макет)
	
	// Остатки
	ОбластьИтогоПоРазделу = Макет.ПолучитьОбласть("ИтогоПоРазделу|ОсновнаяЧасть");
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НадписьИтогоПоРазделу", НСтр("ru='Остаток на конец:'"));
	ОбластьИтогоПоРазделу.Параметры.Заполнить(СтруктураПараметров);
	ТабличныйДокумент.Вывести(ОбластьИтогоПоРазделу);
	
	ВывестиСуммы(Остатки, "ИтогоПоРазделу", Макет, ТабличныйДокумент);
	
КонецПроцедуры

Процедура ВывестиРасходы(ДанныеБюджета, КолонкиДетализации, ТабличныйДокумент, Макет)
	
	Если  Не ЗначениеЗаполнено(ДанныеБюджета.Расходы) Тогда
		Возврат;
	КонецЕсли;
	
	// Раздел "Расходы"
	Раздел = НСтр("ru='Расходы'");
	ВывестиРаздел(Раздел, КолонкиДетализации, ТабличныйДокумент, Макет);
	
	// Строки таблицы
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаНаправлениеДеятельности|ОсновнаяЧасть");
	НомерПоПорядку = 1;
	
	ТаблицаРасходыПоНаправлениямДеятельности = ДанныеБюджета.СтруктураРасходов.Скопировать();
	ТаблицаРасходыПоНаправлениямДеятельности.Свернуть("НаправлениеДеятельности");
	Для Каждого НаправлениеДеятельности Из ТаблицаРасходыПоНаправлениямДеятельности.ВыгрузитьКолонку("НаправлениеДеятельности") Цикл
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("НомерСтроки",   НомерПоПорядку);
		СтруктураПараметров.Вставить("НаправлениеДеятельности", НаправлениеДеятельности);
		ОбластьСтрока.Параметры.Заполнить(СтруктураПараметров);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		
		Отбор = Новый Структура("НаправлениеДеятельности", НаправлениеДеятельности);
		ТаблицаРасходовПоНаправлениямДеятельности = ДанныеБюджета.РасходыПоНаправлениямДеятельности.Скопировать(Отбор);
		ВывестиСуммы(ТаблицаРасходовПоНаправлениямДеятельности, "СтрокаНаправлениеДеятельности", Макет, ТабличныйДокумент);
		
		// Выводим подчиненные статьи расходов
		Отбор = Новый Структура(
			"НаправлениеДеятельности, Родитель",
			НаправлениеДеятельности, Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка());
		Уровень = 1;
		НомерПоПорядкуДляСтатьи = СтрШаблон("%1.", НомерПоПорядку);
		ВывестиСтрокиРасходовПоНаправлениюДеятельности(
			ДанныеБюджета,
			Отбор,
			НомерПоПорядкуДляСтатьи,
			Макет,
			ТабличныйДокумент,
			Уровень);
		
		НомерПоПорядку = НомерПоПорядку + 1;
		
	КонецЦикла;
	
	// Итоги по разделу
	ОбластьИтогоПоРазделу = Макет.ПолучитьОбласть("ИтогоПоРазделу|ОсновнаяЧасть");
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НадписьИтогоПоРазделу", НСтр("ru='Итого расходов:'"));
	ОбластьИтогоПоРазделу.Параметры.Заполнить(СтруктураПараметров);
	ТабличныйДокумент.Вывести(ОбластьИтогоПоРазделу);
	
	ТаблицаРасходов = ДанныеБюджета.РасходыПоНаправлениямДеятельности.Скопировать();
	ТаблицаРасходов.Свернуть("ДатаПланирования", "Сумма");
	ВывестиСуммы(ТаблицаРасходов, "ИтогоПоРазделу", Макет, ТабличныйДокумент);
	
КонецПроцедуры

Процедура ВывестиСтрокиРасходовПоНаправлениюДеятельности(ДанныеБюджета, Отбор, НомерПоПорядкуДляСтатьи, Макет, ТабличныйДокумент, Уровень)

	ТаблицаСтруктураРасходов = ДанныеБюджета.СтруктураРасходов.Скопировать(Отбор);
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаРасхода|ОсновнаяЧасть");
		
	НомерПоПорядку = 1;
	Для Каждого СтрокаРасходов Из ТаблицаСтруктураРасходов Цикл
		
		
		СтатьяРасхода = СтрокаРасходов.СтатьяРасхода;
		Если Не ЗначениеЗаполнено(СтатьяРасхода) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("НомерСтроки",   СтрШаблон("%1%2", НомерПоПорядкуДляСтатьи, НомерПоПорядку));
		СтруктураПараметров.Вставить("СтатьяРасхода", СтатьяРасхода);
		ОбластьСтрока.Параметры.Заполнить(СтруктураПараметров);
		ОбластьСтрока.Области.СтатьяРасхода.Отступ = Уровень * 2;
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		
		ТаблицаПоСтатьям = ДанныеБюджета.Расходы.Скопировать(
			Новый Структура("НаправлениеДеятельности, СтатьяРасхода", 
			Отбор.НаправлениеДеятельности, СтатьяРасхода));
		ВывестиСуммы(ТаблицаПоСтатьям, "СтрокаРасхода", Макет, ТабличныйДокумент);
		
		Если СтрокаРасходов.ЭтоГруппа Тогда
			НовыйОтбор = ОбщегоНазначения.СкопироватьРекурсивно(Отбор);
			НовыйОтбор.Родитель = СтатьяРасхода;
			НовыйНомерПоПорядкуДляСтатьи = СтрШаблон("%1%2.", НомерПоПорядкуДляСтатьи, НомерПоПорядку);
			НовыйУровень = Уровень + 1;
			ВывестиСтрокиРасходовПоНаправлениюДеятельности(
				ДанныеБюджета,
				НовыйОтбор,
				НовыйНомерПоПорядкуДляСтатьи,
				Макет,
				ТабличныйДокумент,
				НовыйУровень);
		КонецЕсли;
		
		НомерПоПорядку = НомерПоПорядку + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиСуммы(Таблица, ИмяОбласти, Макет, ТабличныйДокумент)
	
	Таблица.Сортировать("ДатаПланирования Возр");
	
	Для Каждого Строка Из Таблица Цикл
		Если Не ЗначениеЗаполнено(Строка.ДатаПланирования) Тогда
			// У итого нет даты планирования
			ОбластьСтрокаДетализация = Макет.ПолучитьОбласть(СтрШаблон("%1|Итого", ИмяОбласти));
		Иначе
			ОбластьСтрокаДетализация = Макет.ПолучитьОбласть(СтрШаблон("%1|Детализация", ИмяОбласти));
		КонецЕсли;
		ОбластьСтрокаДетализация.Параметры.Заполнить(Строка);
		ТабличныйДокумент.Присоединить(ОбластьСтрокаДетализация);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиПодвал(РеквизитыДокумента, ТабличныйДокумент, Макет)
	
	ОтветственныеЛицаОрганизации = ОтветственныеЛицаБП.ОтветственныеЛица(
		РеквизитыДокумента.Организация, РеквизитыДокумента.Период);
	
	Подвал = Макет.ПолучитьОбласть("Подвал");
	Подвал.Параметры.Заполнить(ОтветственныеЛицаОрганизации);
	ТабличныйДокумент.Вывести(Подвал);
	
КонецПроцедуры

Функция ТабличныйДокументДляВыгрузкиВExcel(Объект, КолонкиДетализации) Экспорт 
	
	ДанныеБюджета = БюджетДоходовРасходов.НовыйДанныеБюджета(); 
	
	Для Каждого Строка Из Объект.Доходы Цикл
		ЗаполнитьЗначенияСвойств(ДанныеБюджета.Доходы.Добавить(), Строка);
	КонецЦикла;  
	
	Для Каждого Строка Из Объект.СтруктураДоходов Цикл
		ЗаполнитьЗначенияСвойств(ДанныеБюджета.СтруктураДоходов.Добавить(), Строка);
	КонецЦикла; 
	
	Для Каждого Строка Из Объект.Расходы Цикл
		ЗаполнитьЗначенияСвойств(ДанныеБюджета.Расходы.Добавить(), Строка);
	КонецЦикла;
	
	Для Каждого Строка Из Объект.СтруктураРасходов Цикл
		ЗаполнитьЗначенияСвойств(ДанныеБюджета.СтруктураРасходов.Добавить(), Строка);
	КонецЦикла; 
	
	Для Каждого Строка Из Объект.РасходыПоНаправлениямДеятельности Цикл
		ЗаполнитьЗначенияСвойств(ДанныеБюджета.РасходыПоНаправлениямДеятельности.Добавить(), Строка);
	КонецЦикла;
	
	Макет = Обработки.Бюджет.ПолучитьМакет("ВыгрузкаВФайл");
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ОбластьШапкаОсновное = Макет.ПолучитьОбласть("Шапка|ОсновнаяЧасть");
	ТабличныйДокумент.Вывести(ОбластьШапкаОсновное); 
	   
	ОбластьШапкаПериод = Макет.ПолучитьОбласть("Шапка|Детализация");
		
	Для Каждого Колонка Из КолонкиДетализации Цикл
		ОбластьШапкаПериод.Параметры.Период = Колонка.Заголовок;
		ТабличныйДокумент.Присоединить(ОбластьШапкаПериод);
	КонецЦикла;
	
	СтруктураПоиска = Новый Структура("Родитель", Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка());
	ТаблицаСтруктурыДоходов = ДанныеБюджета.СтруктураДоходов.Скопировать(СтруктураПоиска);
	ЗаполнитьДоходыСИерархией(ТаблицаСтруктурыДоходов, ДанныеБюджета, КолонкиДетализации, ТабличныйДокумент, Макет);
	ЗаполнитьРасходыСИерархией(ДанныеБюджета, ТабличныйДокумент, Макет);
	
	// Скроем колонки с UID`ами статьи ддс и направления деятельности
	ТабличныйДокумент.Область("C3").Видимость = Ложь;
	ТабличныйДокумент.Область("C4").Видимость = Ложь; 
	ТабличныйДокумент.Область("C5").Видимость = Ложь;
	ТабличныйДокумент.Область("C7").Видимость = Ложь;
			
	Возврат ТабличныйДокумент;
		
КонецФункции 

Процедура ЗаполнитьДоходыСИерархией(ТаблицаСтруктураДоходов, ДанныеБюджета, КолонкиДетализации, ТабличныйДокумент, Макет)
	
	Раздел = НСтр("ru = 'Финансирование'");  
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка|ОсновнаяЧасть");
	
	Для Каждого СтрокаДоходы Из ТаблицаСтруктураДоходов Цикл		
		
		Если СтрокаДоходы.ЭтоГруппа Тогда
			НоваяТаблицаСтруктурыДоходов = ДанныеБюджета.СтруктураДоходов.Скопировать(Новый Структура("Родитель", СтрокаДоходы.СтатьяДохода));
			ЗаполнитьДоходыСИерархией(НоваяТаблицаСтруктурыДоходов, ДанныеБюджета, КолонкиДетализации, ТабличныйДокумент, Макет);
			Продолжить;
		КонецЕсли;
		
		СтруктураПараметров = Новый Структура;  
		СтруктураПараметров.Вставить("УИДСтатьиДДС", СтрокаДоходы.СтатьяДохода.УникальныйИдентификатор());
		СтруктураПараметров.Вставить("Раздел", Раздел);
		СтруктураПараметров.Вставить("СтатьяДДС", СтрокаДоходы.СтатьяДохода);
		СтруктураПараметров.Вставить("УИДСтатьиДДС", СтрокаДоходы.СтатьяДохода.УникальныйИдентификатор());
		Если ЗначениеЗаполнено(СтрокаДоходы.Родитель) Тогда
			СтруктураПараметров.Вставить("ГруппаСтатей", СтрокаДоходы.Родитель);  
			СтруктураПараметров.Вставить("УИДГруппыСтатей", СтрокаДоходы.Родитель.УникальныйИдентификатор());
		КонецЕсли;
		ОбластьСтрока.Параметры.Заполнить(СтруктураПараметров);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		
		ТаблицаДоходовПоСтатье = ДанныеБюджета.Доходы.Скопировать(Новый Структура("СтатьяДохода", СтрокаДоходы.СтатьяДохода));
		ЗаполнитьСуммы(ТаблицаДоходовПоСтатье, "Строка", Макет, ТабличныйДокумент);

	КонецЦикла;
	
КонецПроцедуры 

Процедура ЗаполнитьСуммы(Таблица, ИмяОбласти, Макет, ТабличныйДокумент)
	
	Таблица.Сортировать("ДатаПланирования Возр");
	ГодоваяСумма = 0;
	ОбластьСтрокаДетализация = Макет.ПолучитьОбласть(СтрШаблон("%1|Детализация", ИмяОбласти)); 
	
	Для Каждого Строка Из Таблица Цикл
		Если ЗначениеЗаполнено(Строка.ДатаПланирования) Тогда 
			ОбластьСтрокаДетализация.Параметры.Заполнить(Строка);
			ТабличныйДокумент.Присоединить(ОбластьСтрокаДетализация);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРасходыСИерархией(ДанныеБюджета, ТабличныйДокумент, Макет)
	
	Раздел = НСтр("ru = 'Расход'");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка|ОсновнаяЧасть");	
	ТаблицаРасходыПоНаправлениямДеятельности = ДанныеБюджета.СтруктураРасходов.Скопировать();
	ТаблицаРасходыПоНаправлениямДеятельности.Свернуть("НаправлениеДеятельности"); 
	
	Для Каждого НаправлениеДеятельности Из ТаблицаРасходыПоНаправлениямДеятельности.ВыгрузитьКолонку("НаправлениеДеятельности") Цикл	
		Отбор = Новый Структура("НаправлениеДеятельности, Родитель", НаправлениеДеятельности, Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка());	
		ЗаполнитьСтрокиРасходовПоНаправлениюДеятельностиИСтатье(ДанныеБюджета, Отбор, Макет, ТабличныйДокумент, Раздел);		
	КонецЦикла; 
	
КонецПроцедуры 

Процедура ЗаполнитьСтрокиРасходовПоНаправлениюДеятельностиИСтатье(ДанныеБюджета, Отбор, Макет, ТабличныйДокумент, Раздел)
	
	ТаблицаСтруктураРасходов = ДанныеБюджета.СтруктураРасходов.Скопировать(Отбор);
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка|ОсновнаяЧасть");
	
	Для Каждого СтрокаРасходов Из ТаблицаСтруктураРасходов Цикл
		
		СтатьяРасхода = СтрокаРасходов.СтатьяРасхода;
		НаправлениеДеятельности = СтрокаРасходов.НаправлениеДеятельности;
		Если Не ЗначениеЗаполнено(СтатьяРасхода) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаРасходов.ЭтоГруппа Тогда
			НовыйОтбор = ОбщегоНазначения.СкопироватьРекурсивно(Отбор);
			НовыйОтбор.Родитель = СтатьяРасхода;
			ЗаполнитьСтрокиРасходовПоНаправлениюДеятельностиИСтатье(ДанныеБюджета, НовыйОтбор, Макет, ТабличныйДокумент, Раздел);
			Продолжить;
		КонецЕсли;
		
		СтруктураПараметров = Новый Структура; 
		СтруктураПараметров.Вставить("УИДНаправленияДеятельности", НаправлениеДеятельности.УникальныйИдентификатор()); 
		СтруктураПараметров.Вставить("УИДСтатьиДДС", СтатьяРасхода.УникальныйИдентификатор());
		СтруктураПараметров.Вставить("Раздел", Раздел);
		СтруктураПараметров.Вставить("НаправлениеДеятельности", НаправлениеДеятельности);
		СтруктураПараметров.Вставить("СтатьяДДС", СтатьяРасхода);
		Если ЗначениеЗаполнено(СтрокаРасходов.Родитель) Тогда
			СтруктураПараметров.Вставить("ГруппаСтатей", СтрокаРасходов.Родитель);
			СтруктураПараметров.Вставить("УИДГруппыСтатей", СтрокаРасходов.Родитель.УникальныйИдентификатор());
		КонецЕсли;

		ОбластьСтрока.Параметры.Заполнить(СтруктураПараметров);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		
		ТаблицаПоСтатьям = ДанныеБюджета.Расходы.Скопировать(
			Новый Структура("НаправлениеДеятельности, СтатьяРасхода", Отбор.НаправлениеДеятельности, СтатьяРасхода));
		ЗаполнитьСуммы(ТаблицаПоСтатьям, "Строка", Макет, ТабличныйДокумент);
		
	КонецЦикла;
	
КонецПроцедуры 
#КонецОбласти
#КонецЕсли
